[
  {
    "title": "Hillel and the Convert",
    "ref": "Shabbat 31a:6",
    "desc": "A potential convert asks Hillel to teach him the whole Torah while standing on one foot."
  },
  {
    "title": "Kamtza and Bar Kamtza",
    "ref": "Gittin 55b:17-56a:4",
    "desc": "The tragic story of a party invitation gone wrong that led to the destruction of Jerusalem."
  },
  {
    "title": "The Oven of Akhnai",
    "ref": "Bava Metzia 59b:1-5",
    "desc": "The Sages debate God Himself, proving that the Torah is 'not in Heaven' but in the hands of man."
  },
  {
    "title": "Honi the Circle Maker",
    "ref": "Taanit 23a:15-17",
    "desc": "Honi sleeps for 70 years and wakes up to a world that no longer recognizes him."
  },
  {
    "title": "Rabbi Akiva's Beginning",
    "ref": "Ketubot 62b:15-63a:2",
    "desc": "How a poor shepherd became the greatest scholar thanks to the sacrifice of his wife, Rachel."
  },
  {
    "title": "Resh Lakish and Rabbi Yochanan",
    "ref": "Bava Metzia 84a:12-18",
    "desc": "A bandit becomes a scholar after a chance meeting in the Jordan River, but a tragic argument ends in heartbreak."
  },
  {
    "title": "Moses in Rabbi Akiva's Classroom",
    "ref": "Menachot 29b:3-4",
    "desc": "Moses time-travels to see Rabbi Akiva teaching and is humbled by what he sees."
  },
  {
    "title": "The Man Who Tempted the Nazir",
    "ref": "Nedarim 9b:5-7",
    "desc": "Shimon HaTzaddik meets a beautiful shepherd who chooses to cut his hair for God."
  },
  {
    "title": "Turn Back, Meir",
    "ref": "Chagigah 15a:12",
    "desc": "Rabbi Meir learns Torah from the heretic Elisha ben Abuyah, even as he rides a horse on Shabbat."
  },
  {
    "title": "Hillel in the Snow",
    "ref": "Yoma 35b:7-8",
    "desc": "A poor Hillel climbs to the roof of the study hall to listen to Torah in the freezing cold."
  },
  {
    "title": "The Four Who Entered Pardes",
    "ref": "Chagigah 14b:8-9",
    "desc": "Four great Sages enter a mystical orchard; only Rabbi Akiva emerges unscathed."
  },
  {
    "title": "Rabbi Shimon in the Cave",
    "ref": "Shabbat 33b:5-34a:2",
    "desc": "Fleeing Roman execution, Rabbi Shimon bar Yochai and his son hide in a cave for 12 years."
  },
  {
    "title": "The Repentance of Elazar ben Durdaya",
    "ref": "Avodah Zarah 17a:12-16",
    "desc": "A man known for visiting every prostitute in the world realizes he must save his own soul."
  },
  {
    "title": "Nahum Ish Gamzu",
    "ref": "Taanit 21a:11-14",
    "desc": "The teacher of Rabbi Akiva who accepted every misfortune with the phrase, 'This too is for the good.'"
  },
  {
    "title": "Wine in Earthen Vessels",
    "ref": "Nedarim 50b:3-4",
    "desc": "Rabbi Yehoshua teaches the Emperor's daughter that wisdom, like wine, keeps best in humble vessels."
  },
  {
    "title": "The Messiah at the Gates of Rome",
    "ref": "Sanhedrin 98a:16-17",
    "desc": "Rabbi Yehoshua ben Levi finds the Messiah among the beggars and asks him when he is coming."
  },
  {
    "title": "The Handmaid's Prayer",
    "ref": "Ketubot 104a:2-6",
    "desc": "While the Sages pray for Rabbi Yehuda HaNasi to live, his servant prays for his suffering to end."
  },
  {
    "title": "The Jokers of the Market",
    "ref": "Taanit 22a:7",
    "desc": "Elijah the Prophet reveals that two comedians are the most deserving of the World to Come."
  },
  {
    "title": "Alexander at the Gates of Eden",
    "ref": "Tamid 32b:2-4",
    "desc": "Alexander the Great demands entry to Paradise but receives a human eyeball that outweighs all his gold."
  },
  {
      "title": "The Ugly Man",
      "ref": "Taanit 20a:16-20b:3",
      "desc": "Rabbi Elazar son of Rabbi Shimon insults an ugly man, only to be told: 'Go tell the Craftsman who made me how ugly I am.'"
  },
  {
      "title": "Rav Preida's Patience",
      "ref": "Eruvin 54b:20-22",
      "desc": "A teacher who taught a student the same lesson 400 times (and then 400 times again) is rewarded by God."
  },
    {
      "title": "The Miracle of the Vinegar",
      "ref": "Taanit 25a:5",
      "desc": "When his daughter mistakes vinegar for oil on Shabbat, Rabbi Chanina ben Dosa says: 'He who commanded oil to burn will command vinegar to burn.'"
    },
    {
      "title": "Titus and the Gnat",
      "ref": "Gittin 56b:13-17",
      "desc": "After destroying the Temple and challenging God, Titus is tortured for years by a gnat buzzing in his brain."
    },
    {
      "title": "How to Respect One's Parents",
      "ref": "Kiddushin 31a:9-11",
      "desc": "A gentile loses a fortune because he refuses to wake his sleeping father to retrieve a key."
    },
    {
      "title": "How To Respect Your Mother",
      "ref": "Kiddushin 31b:5",
      "desc": "Rabbi Tarfon acts as a footstool for his elderly mother, yet the Sages tell him he hasn't done enough."
    },
    {
      "title": "Rav Huna's Sour Wine",
      "ref": "Berakhot 5b:17-20",
      "desc": "When Rav Huna loses 400 barrels of wine, the Sages urge him to examine his actions rather than blame bad luck."
    },
    {
      "title": "All for the Best",
      "ref": "Berakhot 60b:12-61a:1",
      "desc": "Rabbi Akiva is stranded in the woods as his lamp, rooster, and donkey are killed, only to realize it saved him from capture."
    },
    {
      "title": "King David and the Angel of Death",
      "ref": "Shabbat 30a:9-30b:2",
      "desc": "King David learns he will die on Shabbat, so he studies Torah non-stop to prevent the Angel of Death from touching him."
    },
    {
      "title": "Herod Kills All the Rabbis Except One",
      "ref": "Bava Batra 3b:14-4a:6",
      "desc": "King Herod kills all the Rabbis except Bava ben Buta, whom he blinds, only to later regret it and ask for a way to atone."
    },
  {
    "title": "Hillel's Patience",
    "ref": "Shabbat 30b:12-31a:4",
    "desc": "Two men bet money on whether one can make Hillel angry; despite many interruptions, Hillel remains calm."
  },
  {
    "title": "Rabbi Yehuda and the Calf",
    "ref": "Bava Metzia 85a:5-7",
    "desc": "Rabbi Yehuda HaNasi suffers for years because he showed no mercy to a calf being taken to slaughter."
  },
  {
    "title": "Rabbi Akiva's Daughter",
    "ref": "Shabbat 156b:4-5",
    "desc": "Astrologers predict Rabbi Akiva's daughter will die on her wedding day, but her act of charity saves her from a snake."
  },
  {
    "title": "King Solomon and Ashmedai, the King of the Demons",
    "ref": "Gittin 68a:7-68b:20",
    "desc": "After being overthrown by the demon Ashmedai, King Solomon wanders the land claiming to be king, but no one believes him."
  },
  {
    "title": "Rabbi Chanina and the Lizard",
    "ref": "Berakhot 33a:8-10",
    "desc": "Rabbi Chanina proves that it is not the lizard (arvad) that kills, but sin that kills, by placing his heel over its hole."
  },
  {
    "title": "Rav Amram and the Ladder",
    "ref": "Kiddushin 81a:11-12",
    "desc": "To stop himself from sinning with a captive woman, Rav Amram moves a heavy ladder and shouts 'Fire in Amram’s house!' to shame his own impulse."
  },
  {
    "title": "Mar Ukva's Charity",
    "ref": "Ketubot 67b:12-14",
    "desc": "Mar Ukva and his wife hide inside a hot oven to avoid shaming a poor man they were secretly giving money to."
  },
  {
    "title": "Yosef Who Honors Shabbat",
    "ref": "Shabbat 119a:5",
    "desc": "A wealthy neighbor sells his estate to avoid it going to Yosef, but the proceeds (a pearl) end up in a fish on Yosef's Shabbat table."
  }
]

